Repository: zibuyu2015831/LangoTrace
Catalog: Packages/LangoTraceUI/Sources/LangoTraceUI/Resources/Localizable.xcstrings
Source language: en
Languages: de, es, fr, ja, ko, ru, zh_hans

# welcome.tracePreview.practice
source: Shadowing · Save · Review
de: Shadowing · Speichern · Wiederholen
es: Shadowing · Guardar · Repasar
fr: Shadowing · Enregistrer · Revoir
ja: Shadowing · 保存 · 復習
ko: Shadowing · 저장 · 복습
ru: Shadowing · Сохранить · Повторить
zh_hans: Shadowing · 收藏 · 复习

# welcome.tracePreview.rewrittenTextTitle
source: Rewrite
de: Umschreibung
es: Reescritura
fr: Reformulation
ja: 書き換え
ko: 다시 쓰기
ru: Переписано
zh_hans: 改写

# welcome.tracePreview.scene
source: Morning coffee
de: Morgenkaffee
es: Cafe de la manana
fr: Cafe du matin
ja: 朝のコーヒー
ko: 아침 커피
ru: Утренний кофе
zh_hans: 咖啡店点单

# welcome.tracePreview.sourceNoteTitle
source: My note
de: Meine Notiz
es: Mi nota
fr: Ma note
ja: 私のメモ
ko: 내 메모
ru: Моя заметка
zh_hans: 我的随笔

# welcome.tracePreview.title
source: Today's Trace
de: Heutige Spur
es: Trazo de hoy
fr: Trace du jour
ja: 今日の語跡
ko: 오늘의 기록
ru: Сегодняшний след
zh_hans: 今日语迹

# welcome.valueSubtitle
source: Take photos and jot notes. LangoTrace turns them into expressions and practice.
de: Fotografiere und notiere Gedanken. LangoTrace macht daraus Ausdrücke und Übungen.
es: Haz fotos y toma notas. LangoTrace las convierte en expresiones y práctica.
fr: Prenez des photos et notez vos pensées. LangoTrace en fait des expressions et des exercices.
ja: 写真とメモを、LangoTrace が表現と練習に整理します。
ko: 사진과 짧은 글을 LangoTrace가 표현과 연습으로 정리합니다.
ru: Снимайте фото и делайте заметки. LangoTrace превращает их в выражения и практику.
zh_hans: 拍照、随笔， 语迹会帮你整理成表达和练习

# welcome.valueTitle
source: Turn life into your language material.
de: Mach dein Leben zu Sprachmaterial.
es: Convierte tu vida en material de idioma.
fr: Transformez la vie en matière linguistique.
ja: 日常を 言語素材に変える。
ko: 생활을 언어 자료로 바꾸세요.
ru: Превратите жизнь в языковой материал.
zh_hans: 把生活， 变成你的语言素材。

# privacyStatus.sync.title
source: Sync
es: Sincronización
fr: Synchronisation
ja: 同期
ko: 동기화
ru: Синхронизация
zh_hans: 同步

# settings.interfaceLanguage.system
source: System
es: Sistema
fr: Système
ja: システムに従う
ko: 시스템 따르기
ru: Система
zh_hans: 跟随系统

# settings.sync.title
source: Sync
es: Sincronización
fr: Synchronisation
ja: 同期
ko: 동기화
ru: Синхронизация
zh_hans: 同步

# welcome.tracePreview.examples.meeting.scene
source: Team meeting
es: Reunion de equipo
fr: Reunion d equipe
ja: チーム会議
ko: 팀 회의
ru: Командная встреча
zh_hans: 工作会议

# welcome.tracePreview.shadowingCueTitle
source: Shadowing
ja: シャドーイング
ko: 섀도잉
ru: Шэдоуинг
zh_hans: 跟读

# accessibility.hidden
source: Hidden
zh_hans: 隐藏

# accessibility.selected
source: Selected
zh_hans: 当前选中

# accessibility.selectedCount
source: Selected, %@ items
zh_hans: 当前选中，%@ 项

# accessibility.unselected
source: Not selected
zh_hans: 未选中

# accessibility.unselectedCount
source: Not selected, %@ items
zh_hans: 未选中，%@ 项

# accessibility.visible
source: Visible
zh_hans: 可见

# aiProviderSettings.advancedModels.title
source: Advanced models
zh_hans: 高级模型

# aiProviderSettings.apiKey.helper.unsaved
source: Enter or paste an API Key, then save to store it in the local Keychain.
zh_hans: 输入或粘贴 API Key 后保存，会写入本机 Keychain。

# aiProviderSettings.apiKey.hide
source: Hide API Key
zh_hans: 隐藏 API Key

# aiProviderSettings.apiKey.placeholder
source: No API Key saved
zh_hans: 当前未保存 API Key

# aiProviderSettings.apiKey.placeholder.saved
source: Saved to local Keychain
zh_hans: 已保存到本机 Keychain

# aiProviderSettings.apiKey.placeholder.unsaved
source: No API Key saved
zh_hans: 当前未保存 API Key

# aiProviderSettings.apiKey.revealError.cancelled
source: Viewing was cancelled.
zh_hans: 已取消查看

# aiProviderSettings.apiKey.revealError.credentialInaccessible
source: Cannot read the API Key from Keychain. Authenticate again, try later, or replace it.
zh_hans: 无法读取 Keychain 中的 API Key。你可以重新认证、稍后再试，或替换 API Key。

# aiProviderSettings.apiKey.revealError.missingCredential
source: This device cannot find the saved API Key. Enter it again.
zh_hans: 这台设备上找不到已保存的 API Key，请重新输入。

# aiProviderSettings.apiKey.revealError.userInteractionRequired
source: Local authentication is required before viewing the API Key.
zh_hans: 需要本机认证后才能查看 API Key。

# aiProviderSettings.apiKey.show
source: Show API Key
zh_hans: 显示 API Key

# aiProviderSettings.apiKey.useIndependent
source: Independent API Key
zh_hans: 使用独立 API Key

# aiProviderSettings.apiKey.useText
source: Use text model API Key
zh_hans: 使用文本模型 API Key

# aiProviderSettings.authHeader.title
source: Auth
zh_hans: 认证方式

# aiProviderSettings.capabilities.title
source: Capability boundary
zh_hans: 能力边界

# aiProviderSettings.capability.chat
source: Chat
zh_hans: 文本生成

# aiProviderSettings.capability.embedding
source: Embedding
zh_hans: 向量化

# aiProviderSettings.capability.enabled
source: On
zh_hans: 已开启

# aiProviderSettings.capability.image
source: Image
zh_hans: 图片理解

# aiProviderSettings.capability.image.adapterUnsupported
source: This request format does not support image testing yet.
zh_hans: 当前请求格式暂不支持图片测试

# aiProviderSettings.capability.image.modelDependent
source: Image understanding requires a model that supports image input.
zh_hans: 图片理解功能需要选择支持图片输入的模型

# aiProviderSettings.capability.image.supported
source: Available. Enable it to include the built-in synthetic image in configuration tests.
zh_hans: 可用。启用后，配置测试会携带内置合成图片。

# aiProviderSettings.capability.image.unsupportedProvider
source: This provider preset does not support image input.
zh_hans: 当前 Provider 预设不支持图片输入

# aiProviderSettings.capability.tts
source: TTS
zh_hans: 语音合成

# aiProviderSettings.capability.unsupported
source: Not supported by the selected provider
zh_hans: 当前 Provider 不支持

# aiProviderSettings.chatModel.title
source: Chat model
zh_hans: 文本模型

# aiProviderSettings.connection.title
source: Connection
zh_hans: 连接信息

# aiProviderSettings.credential.title
source: Credential
zh_hans: 凭证

# aiProviderSettings.credential.useIndependent
source: Independent
zh_hans: 独立凭证

# aiProviderSettings.credential.useText
source: Use text credential
zh_hans: 使用文本凭证

# aiProviderSettings.credentials.boundary
source: Saved API keys are encrypted locally and kept separate from ordinary settings.
zh_hans: 保存后的 API Key 会在本机加密，并与普通设置分开。

# aiProviderSettings.credentials.title
source: Credentials
zh_hans: 凭证

# aiProviderSettings.embeddingModel.title
source: Embedding model
zh_hans: 向量模型

# aiProviderSettings.embeddingModelGroup.enable
source: Enable embedding
zh_hans: 启用向量模型

# aiProviderSettings.embeddingModelGroup.modelTitle
source: Embedding model
zh_hans: 向量模型

# aiProviderSettings.embeddingModelGroup.title
source: Embedding model
zh_hans: 向量模型

# aiProviderSettings.header.body
source: Prepare the secure provider profile that later AI requests will read from.
zh_hans: 先整理安全 Provider 配置，后续 AI 请求会从这里读取。

# aiProviderSettings.models.title
source: Models
zh_hans: 模型

# aiProviderSettings.privacy.body
source: Saving provider information will not send life entries. Content is sent only when you explicitly start an AI action; this UI pass does not write Keychain data yet.
zh_hans: 保存 Provider 信息不会发送生活记录。只有你主动触发 AI 动作时才会发送选中内容；本轮 UI 还不写入钥匙串。

# aiProviderSettings.privacy.title
source: Privacy
zh_hans: 隐私

# aiProviderSettings.probeCapability.embedding
source: Embedding
zh_hans: 向量化

# aiProviderSettings.probeCapability.imageUnderstanding
source: Image understanding
zh_hans: 图片理解

# aiProviderSettings.probeCapability.languageSupport
source: Language support
zh_hans: 语言支持

# aiProviderSettings.probeCapability.speechPreview
source: Play test voice
zh_hans: 试听测试语音

# aiProviderSettings.probeCapability.speechPreviewPlaying
source: Playing test voice
zh_hans: 正在播放测试语音

# aiProviderSettings.probeCapability.speechSynthesis
source: Speech generation
zh_hans: 语音生成

# aiProviderSettings.probeCapability.structuredJSON
source: JSON output
zh_hans: JSON 输出

# aiProviderSettings.probeCapability.textReply
source: Text reply
zh_hans: 文本回复

# aiProviderSettings.probeCapabilityError.audioDecodeFailed
source: Decode failed
zh_hans: 解码失败

# aiProviderSettings.probeCapabilityError.authenticationFailed
source: Auth failed
zh_hans: 认证失败

# aiProviderSettings.probeCapabilityError.credentialInaccessible
source: Key unavailable
zh_hans: 密钥不可用

# aiProviderSettings.probeCapabilityError.invalidAudioResponse
source: Invalid audio
zh_hans: 音频异常

# aiProviderSettings.probeCapabilityError.invalidEmbeddingResponse
source: Invalid vectors
zh_hans: 向量异常

# aiProviderSettings.probeCapabilityError.invalidResponse
source: Invalid response
zh_hans: 响应异常

# aiProviderSettings.probeCapabilityError.invalidVoice
source: Check voice
zh_hans: 检查音色

# aiProviderSettings.probeCapabilityError.missingCredential
source: Missing key
zh_hans: 缺少密钥

# aiProviderSettings.probeCapabilityError.networkUnavailable
source: Network issue
zh_hans: 网络异常

# aiProviderSettings.probeCapabilityError.providerRejected
source: Rejected
zh_hans: 请求被拒

# aiProviderSettings.probeCapabilityError.quotaExceeded
source: Quota exceeded
zh_hans: 额度不足

# aiProviderSettings.probeCapabilityError.rateLimited
source: Rate limited
zh_hans: 请求受限

# aiProviderSettings.probeCapabilityError.timeout
source: Timed out
zh_hans: 请求超时

# aiProviderSettings.probeCapabilityError.unsupportedAudioFormat
source: Format unsupported
zh_hans: 格式不支持

# aiProviderSettings.probeCapabilityError.unsupportedEndpointPurpose
source: Not supported
zh_hans: 暂不支持

# aiProviderSettings.probeCapabilityError.unsupportedLanguage
source: Language unsupported
zh_hans: 语言不支持

# aiProviderSettings.probeCapabilityError.unsupportedModel
source: Model unavailable
zh_hans: 模型不可用

# aiProviderSettings.probeCapabilityStatus.cancelled
source: Cancelled
zh_hans: 已取消

# aiProviderSettings.probeCapabilityStatus.failed
source: Issue
zh_hans: 异常

# aiProviderSettings.probeCapabilityStatus.notConfigured
source: Not configured
zh_hans: 未配置

# aiProviderSettings.probeCapabilityStatus.notEnabled
source: Not enabled
zh_hans: 未启用

# aiProviderSettings.probeCapabilityStatus.notRun
source: Not run
zh_hans: 未测试

# aiProviderSettings.probeCapabilityStatus.succeeded
source: Available
zh_hans: 可用

# aiProviderSettings.probeCapabilityStatus.testing
source: Testing
zh_hans: 测试中

# aiProviderSettings.probeCapabilityStatus.unsupported
source: Not supported yet
zh_hans: 暂不支持测试

# aiProviderSettings.probeResult.close
source: Close
zh_hans: 关闭

# aiProviderSettings.probeResult.retry
source: Test again
zh_hans: 重新测试

# aiProviderSettings.probeResult.title
source: Test request
zh_hans: 测试请求

# aiProviderSettings.providerRisk.direct
source: This preset describes the provider endpoint only. Real requests stay disabled until provider execution is wired.
zh_hans: 此预设只描述服务端点。真实请求会在 Provider 执行链路接入后才启用。

# aiProviderSettings.providerRisk.local
source: Local model access depends on the device and network address. iPhone cannot use your Mac localhost directly.
zh_hans: 本地模型访问取决于设备和网络地址。iPhone 不能直接访问 Mac 的 localhost。

# aiProviderSettings.providerRisk.routed
source: Requests may be routed by this service. Model availability, billing, and data handling follow the provider account.
zh_hans: 请求可能由该服务路由。模型可用性、费用和数据处理以服务商账号为准。

# aiProviderSettings.requestFormat.title
source: Request format
zh_hans: 请求格式

# aiProviderSettings.save.button
source: Save configuration
zh_hans: 保存配置

# aiProviderSettings.save.saveChanges.button
source: Save changes
zh_hans: 保存更改

# aiProviderSettings.saveState.failed
source: Could not save configuration
zh_hans: 配置保存失败

# aiProviderSettings.saveState.idle
source: Ready to save securely
zh_hans: 可保存为安全配置

# aiProviderSettings.saveState.missingRequiredFields
source: Complete the enabled model configurations before saving
zh_hans: 请先补齐已启用的模型配置，再保存

# aiProviderSettings.saveState.saved
source: Configuration updated
zh_hans: 配置已更新

# aiProviderSettings.saveState.saving
source: Saving...
zh_hans: 正在保存...

# aiProviderSettings.saveState.unsavedChanges
source: Configuration not saved
zh_hans: 配置未保存

# aiProviderSettings.speechModel.enable
source: Enable speech generation
zh_hans: 启用语音生成

# aiProviderSettings.speechModel.formatTitle
source: Output format
zh_hans: 输出格式

# aiProviderSettings.speechModel.instructionsHelp
source: Optional tone, pace, or delivery guidance for the provider.
zh_hans: 可选填写语气、节奏或朗读方式。

# aiProviderSettings.speechModel.instructionsTitle
source: Speaking style
zh_hans: 朗读风格

# aiProviderSettings.speechModel.modelTitle
source: Speech model
zh_hans: 语音模型

# aiProviderSettings.speechModel.parametersTitle
source: Voice details
zh_hans: 语音细节

# aiProviderSettings.speechModel.speedTitle
source: Speed
zh_hans: 语速

# aiProviderSettings.speechModel.title
source: Speech generation model
zh_hans: 语音生成模型

# aiProviderSettings.speechModel.voiceHelp
source: Choose the voice used for this language.
zh_hans: 选择当前语言使用的声音。

# aiProviderSettings.speechModel.voiceTitle
source: Voice
zh_hans: 音色

# aiProviderSettings.status.secureDraft
source: Secure draft
zh_hans: 安全配置草稿

# aiProviderSettings.testRequest.boundary
source: This build does not send a network request. Later, the test will send only synthetic provider-check text through the Provider layer.
zh_hans: 当前版本不会发起网络请求。后续测试只会通过 Provider 层发送合成检测文本。

# aiProviderSettings.testRequest.button
source: Test request
zh_hans: 测试请求

# aiProviderSettings.testState.cancelled
source: Test cancelled
zh_hans: 测试已取消

# aiProviderSettings.testState.failed
source: Test failed
zh_hans: 测试失败

# aiProviderSettings.testState.idle
source: Ready to check locally
zh_hans: 可进行本地检测

# aiProviderSettings.testState.missingRequiredFields
source: Complete the enabled model configurations first
zh_hans: 请先补齐已启用的模型配置

# aiProviderSettings.testState.partial
source: Partially available
zh_hans: 部分可用

# aiProviderSettings.testState.realTestingUnavailable
source: Real provider test is not connected
zh_hans: 真实 Provider 测试尚未接入

# aiProviderSettings.testState.succeeded
source: Test succeeded
zh_hans: 测试成功

# aiProviderSettings.testState.testing
source: Testing request
zh_hans: 正在测试

# aiProviderSettings.testState.unsupportedProvider
source: Provider test not supported yet
zh_hans: 当前 Provider 暂不支持测试

# aiProviderSettings.textModel.modelTitle
source: Text model
zh_hans: 文本模型

# aiProviderSettings.textModel.title
source: Text model
zh_hans: 文本模型

# aiProviderSettings.ttsModel.title
source: TTS model
zh_hans: 语音模型

# aiRequestLog.capability.companionConversation
source: Companion conversation
zh_hans: 语伴对话

# aiRequestLog.capability.companionExtraction
source: Companion vocabulary extraction
zh_hans: 语伴词汇提取

# aiRequestLog.capability.learningMaterialGeneration
source: Learning material
zh_hans: 学习材料

# aiRequestLog.capability.photoWritingAssist
source: Photo writing assist
zh_hans: 照片写作辅助

# aiRequestLog.capability.practiceBacktranslationReview
source: Back-translation review
zh_hans: 回译点评

# aiRequestLog.capability.readingSelectionExplanation
source: Reading explanation
zh_hans: 阅读释义

# aiRequestLog.empty
source: No AI requests yet.
zh_hans: 还没有 AI 请求记录。

# aiRequestLog.failure.credentialMissing
source: Credential problem
zh_hans: 凭证问题

# aiRequestLog.failure.invalidResponse
source: Unexpected response
zh_hans: 响应异常

# aiRequestLog.failure.network
source: Network problem
zh_hans: 网络问题

# aiRequestLog.failure.persistence
source: Could not save
zh_hans: 保存失败

# aiRequestLog.failure.providerNotConfigured
source: Service not set up
zh_hans: 服务未配置

# aiRequestLog.failure.providerRejected
source: Service declined
zh_hans: 服务方拒绝

# aiRequestLog.failure.timeout
source: Timed out
zh_hans: 请求超时

# aiRequestLog.failure.unknown
source: Unknown problem
zh_hans: 未知问题

# aiRequestLog.failure.unsupported
source: Not supported
zh_hans: 暂不支持

# aiRequestLog.status.cancelled
source: Cancelled
zh_hans: 已取消

# aiRequestLog.status.failed
source: Failed
zh_hans: 失败

# aiRequestLog.status.success
source: Completed
zh_hans: 已完成

# aiRequestLog.title
source: AI request log
zh_hans: AI 请求记录

# audioPanel.title
source: Read-Aloud Audio
zh_hans: 朗读音频

# capabilityStatus.mockOnly
source: Local-first
zh_hans: 本地优先

# capabilityStatus.unavailable
source: Needs setup
zh_hans: 待配置

# common.copied
source: Copied
zh_hans: 已复制

# common.copy
source: Copy
zh_hans: 复制

# common.currentStep
source: Current step
zh_hans: 当前步骤

# common.errorSaveFailedRetry
source: Save failed. Please try again.
zh_hans: 保存失败，请重试。

# common.keepCompleted
source: Keep Completed
zh_hans: 保持完成状态

# common.listen
source: Listen
zh_hans: 听

# common.newEntry
source: New Entry
zh_hans: 新建记录

# common.newEntry.short
source: New
zh_hans: 新建

# common.nextStep
source: Next Step
zh_hans: 下一步

# common.pause
source: Pause
zh_hans: 暂停

# common.practice
source: Practice
zh_hans: 练

# common.saving
source: Saving
zh_hans: 保存中

# common.search
source: Search
zh_hans: 搜索

# common.switchable
source: Can switch
zh_hans: 可切换

# common.writeSentence
source: Write One
zh_hans: 写一句

# companion.action.clear
source: Clear conversation
zh_hans: 清空对话

# companion.entry.talkAboutRecord
source: Talk about this record
zh_hans: 围绕这条记录对话

# companion.entry.title
source: Language Companion
zh_hans: 语伴

# companion.extraction.action
source: Extract vocabulary
zh_hans: 提取词汇 / 表达

# companion.extraction.empty
source: No vocabulary found in this conversation
zh_hans: 本段对话未找到可提取的词汇

# companion.extraction.failure
source: Extraction failed. Your conversation is kept.
zh_hans: 提取失败，对话已保留

# companion.extraction.loading
source: Extracting…
zh_hans: 正在提取…

# companion.extraction.sourceDeleted
source: Source message deleted
zh_hans: 来源消息已删除

# companion.extraction.successCount
source: Extracted %lld items
zh_hans: 已提取 %lld 项

# companion.failure.cancelled
source: The request was cancelled.
zh_hans: 请求已取消。

# companion.failure.rejected
source: Your AI provider rejected the request. Check your provider settings.
zh_hans: AI Provider 拒绝了请求。请检查 Provider 配置。

# companion.failure.retry
source: Retry
zh_hans: 重试

# companion.failure.unavailable
source: The companion can't be reached right now. Check your network or AI provider, then try again.
zh_hans: 暂时联系不上语伴。请检查网络或 AI Provider 后重试。

# companion.greeting.coldStart
source: Say hello to start practicing — your companion always replies in your target language.
zh_hans: 打个招呼开始练习吧——语伴会始终用你的目标语回复。

# companion.input.placeholder
source: Message
zh_hans: 输入消息

# companion.memory.preview.decline
source: Don't use my profile
zh_hans: 不使用学习画像

# companion.memory.preview.notSends
source: Won't send
zh_hans: 不会发送

# companion.memory.preview.sends
source: Will send
zh_hans: 将会发送

# companion.memory.preview.title
source: Use your learner profile in conversation?
zh_hans: 在对话中使用你的学习画像？

# companion.memory.preview.use
source: Use
zh_hans: 使用

# companion.memory.toggle
source: Use my content
zh_hans: 使用我的内容

# companion.topic.preview.decline
source: Don't use my records for topics
zh_hans: 不用我的记录找话题

# companion.topic.preview.title
source: Let the companion find topics from your records?
zh_hans: 让语伴从你的记录里找话题？

# companion.settings.toggle
source: Language Companion
zh_hans: 语伴

# companion.settings.toggle.description
source: Off by default. Practice free conversation in your target language, grounded in your own records.
zh_hans: 默认关闭。用目标语自由对话练习，扎根你自己的生活记录。

# entry.defaultScene
source: Journal
zh_hans: 记录

# entry.defaultTitle
source: New Entry
zh_hans: 新的记录

# entry.detail.collapse
source: Collapse
zh_hans: 收起

# entry.detail.expand
source: Show full text
zh_hans: 展开全文

# entry.detail.learningText.fallbackTitle
source: Target Expression
zh_hans: 目标语表达

# entry.detail.learningText.regenerate
source: Regenerate
zh_hans: 重新生成

# entry.detail.learningText.regenerate.confirm
source: Replace
zh_hans: 替换

# entry.detail.learningText.regenerate.confirmMessage
source: This overwrites the current expression and any manual edits, and runs an AI request.
zh_hans: 这会覆盖当前的英文表达和你的手动修改，并发起一次 AI 请求。

# entry.detail.learningText.regenerate.confirmTitle
source: Replace current content?
zh_hans: 替换当前内容？

# entry.detail.learningText.regenerateMenu
source: Regenerate
zh_hans: 重新生成

# entry.detail.learningText.regenerateMenu.reanalyze
source: Re-explain current text
zh_hans: 重新讲解（当前英文）

# entry.detail.learningText.regenerateMenu.translate
source: Re-translate from record
zh_hans: 重新翻译（按中文记录）

# entry.detail.learningText.sourceStale
source: Based on an older record
zh_hans: 基于旧记录

# entry.detail.learningText.titleFormat
source: %@ Expression
zh_hans: %@表达

# entry.detail.photo.failed.summary
source: The local attachment exists, but the image data could not be decoded.
zh_hans: 本地附件存在，但图片数据无法解码。

# entry.detail.photo.failed.title
source: Photo could not be shown
zh_hans: 照片无法显示

# entry.detail.photo.loading.summary
source: Reading the local attachment on this device.
zh_hans: 正在读取本机保存的照片附件。

# entry.detail.photo.loading.title
source: Loading photo
zh_hans: 正在加载照片

# entry.detail.photo.unavailable.summary
source: This photo record does not have a readable local image attachment.
zh_hans: 这条照片记录没有可读取的本地图片附件。

# entry.detail.photo.unavailable.title
source: Photo missing
zh_hans: 照片缺失

# entry.detail.sourceText.accessibilityLabel
source: Editable source record
zh_hans: 可编辑原始记录

# entry.detail.sourceText.edit
source: Edit record
zh_hans: 编辑记录

# entry.detail.sourceText.editFallbackTitle
source: Edit Original Record
zh_hans: 修改原始记录

# entry.detail.sourceText.editTitleFormat
source: Edit %@ Record
zh_hans: 修改%@记录

# entry.detail.sourceText.fallbackTitle
source: Original Record
zh_hans: 原始记录

# entry.detail.sourceText.saveFailed
source: Could not save this record. Try again in a moment.
zh_hans: 未能保存这条记录。稍后再试。

# entry.detail.sourceText.titleFormat
source: %@ Record
zh_hans: %@记录

# entry.empty.action
source: Create First Entry
zh_hans: 创建第一条记录

# entry.empty.body
source: Write a life moment to start building your language material.
zh_hans: 写下一段生活片段，开始积累自己的语言材料。

# entry.empty.title
source: No entries yet
zh_hans: 还没有记录

# entry.material.status.fresh
source: Learning Material · %d sentences
zh_hans: 学习材料 · %d 句

# entry.material.status.none
source: Not Generated
zh_hans: 未生成

# entry.material.status.stale
source: Based on Old Entry
zh_hans: 基于旧记录

# entry.nativeRecord.title
source: Native Record
zh_hans: 母语记录

# entry.practiceStatus.memorized
source: Memorized
zh_hans: 已入记忆

# entry.practiceStatus.notStarted
source: Not practiced
zh_hans: 待练习

# entry.practiceStatus.practiced
source: %d sessions
zh_hans: 练习 %d 组

# entry.reading.empty
source: No learning material to read yet.
zh_hans: 还没有可阅读的学习材料。

# entry.reading.fontSize.decrease
source: Decrease text size
zh_hans: 缩小字号

# entry.reading.fontSize.increase
source: Increase text size
zh_hans: 放大字号

# entry.reading.open
source: Read full text
zh_hans: 阅读全文

# entry.reading.playAll
source: Play all
zh_hans: 连续播放

# entry.reading.playAll.stop
source: Stop playback
zh_hans: 停止播放

# entry.reading.reveal.hint
source: Tap to show the translation
zh_hans: 点按显示译文

# entry.reading.title
source: Reading
zh_hans: 双语阅读

# entry.rendering.generateLearningMaterial.failedSummary
source: Generation failed. Check the AI Provider settings, then try again.
zh_hans: 生成失败。检查 AI Provider 设置后可以重试。

# entry.rendering.generateLearningMaterial.failedSummary.authFailed
source: Authentication failed. Check your credentials in AI Provider settings.
zh_hans: 认证失败。请检查 AI Provider 设置中的密钥配置。

# entry.rendering.generateLearningMaterial.failedSummary.networkError
source: Network error. Check your connection and try again.
zh_hans: 网络错误。请检查网络连接后重试。

# entry.rendering.generateLearningMaterial.failedSummary.rateLimited
source: Rate limited by the provider. Wait a moment and try again.
zh_hans: 请求频率受限。稍等片刻后重试。

# entry.rendering.generateLearningMaterial.failedSummary.responseError
source: The model returned an unsupported response. Make sure your model supports structured JSON output.
zh_hans: 模型返回的格式不受支持。请确认所选模型支持结构化 JSON 输出。
